---
type: OrdinateDimensionSetting
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# OrdinateDimensionSetting

`Autodesk.Revit.DB.OrdinateDimensionSetting` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | OrdinateDimensionSetting | 2017 Subscription Update | `public OrdinateDimensionSetting ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | DimensionLineLength | 2017 Subscription Update | `public double DimensionLineLength { get ; set ; }` |
| Property | DimensionLineStyle | 2017 Subscription Update | `public OrdinateDimensionLineStyle DimensionLineStyle { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | OriginTickMarkId | 2017 Subscription Update | `public ElementId OriginTickMarkId { get ; set ; }` |
| Property | OriginVisibility | 2017 Subscription Update | `public OrdinateOriginVisibility OriginVisibility { get ; set ; }` |
| Property | TextOrientation | 2017 Subscription Update | `public OrdinateTextOrientation TextOrientation { get ; set ; }` |
| Property | TextPosition | 2017 Subscription Update | `public OrdinateTextPosition TextPosition { get ; set ; }` |